remidavidkoster/Redako-BibiFirmware/STM32G431/Core/Src/main.cpp
#include "main.h"
#include "adc.h"
#include "dma.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

#include <string.h>
#include "ICM-42670-P.h"
#include "NRF24L01P.h"
#include "math.h"
#include "MadgwickAHRS.h"
#include "settings.h"
#include "Syma.h"
#include "motorMath.h"
#include "IMU.h"
#include "BibiSupport.h"
#include "Debug.h"
#include "UID.h"
#include "Radio.h"
#include "encoder.h"
#include "quintic.h"
#include "CRC.h"

void SystemClock_Config(void);


float motorSpeedTarget;
float motorAngleFullDeg; //double

float electricalAngleTarget; //double
float electricalAngle; //double

float diaboloAngleFullDeg; //double
float diaboloPosition; //double
float lastDiaboloPosition; //double

float diaboloZeroPosition;

float diaboloSpeed;
float lastDiaboloSpeed;
float diaboloAcceleration;



float SPEED_ALPHA = 0.01f;
float ACCEL_ALPHA = 0.005f;

uint8_t notYetMoved = 1;

uint8_t firstMovementLoop;

int8_t movementSide;


/// PID Stuff

typedef struct {
	float p, i, d;
	float error;
	float prev_error;
	float derivative;
	float integral;
	float output;

	float dt;
	float alpha;  // Low-pass filter factor for the derivative term

	float limit;

	float target; //double
	float lastTarget; //double
	float reset_threshold;

	float on;
} PIDController;


volatile PIDController PID_WeightAngleWithMotorSpeed = {
		.p = 0.000060f,
		.i = 0.0f,
		.d = 0.000015f,
		.alpha = 0.001f,
		.limit = 30.0f,
		.target = 0.0f,
		.reset_threshold = 5.0f,

		.on = 0
};

volatile PIDController PID_MotorPositionWithVoltage = {
		.p = 15.0f,
		.i = 0.0f,
		.d = 0.5f,
		.alpha = 0.01f,
		.limit = 6.5f,
		.target = 0.0f,
		.reset_threshold = 10000.0f,

		.on = 1
};



volatile PIDController PID_BibiSpeedWithWeightAngle = {
		.p = 100.0f,
		.i = 40.0f,
		.d = 0.0f,
		.alpha = 0.01f,
		.limit = 90.0f,
		.target = 0.0f,
		.reset_threshold = 10000.0f,

		.on = 0
};




volatile PIDController PID_BibiPositionWithBibiSpeed = {
		.p = -0.5f,
		.i = 0.0f,
		.d = 0.0f,
		.alpha = 0.01f,
		.limit = 5.0f,
		.target = 0.0f,
		.reset_threshold = 10000.0f,

		.on = 1
};







// State: [position, velocity, acceleration]
typedef struct {
	float x[3];      // State estimate
	float P[3][3];   // Covariance matrix
} KalmanFilter;

KalmanFilter kf;




void kalman_init(KalmanFilter *kf) {
	kf->x[0] = 0.0f; // position
	kf->x[1] = 0.0f; // velocity
	kf->x[2] = 0.0f; // acceleration

	// Initialize P to identity (can scale if needed)
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 3; j++) {
			kf->P[i][j] = (i == j) ? 1.0f : 0.0f;
		}
	}
}

#define DT (1.0f / SAMPLE_FREQUENCY) // Time step (adjust as needed)

// Noise parameters — TUNE THESE
float R = 0.001f; // Measurement noise variance
float Q[3] = {1e-4f, 1e-3f, 1e-2f}; // Process noise for x, v, a



void kalman_update(KalmanFilter *kf, float z_measured) {
	// Motion model
	float A[3][3] = {
			{1.0f, DT, 0.5f * DT * DT},
			{0.0f, 1.0f, DT},
			{0.0f, 0.0f, 1.0f}
	};

	float H[3] = {1.0f, 0.0f, 0.0f}; // Only position is observed

	float x_pred[3];
	float P_pred[3][3];

	// Predict state: x_pred = A * x
	for (int i = 0; i < 3; i++) {
		x_pred[i] = 0.0f;
		for (int j = 0; j < 3; j++) {
			x_pred[i] += A[i][j] * kf->x[j];
		}
	}

	// Predict covariance: P_pred = A * P * A^T + Q
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 3; j++) {
			P_pred[i][j] = 0.0f;
			for (int k = 0; k < 3; k++) {
				for (int l = 0; l < 3; l++) {
					P_pred[i][j] += A[i][k] * kf->P[k][l] * A[j][l]; // Correct matrix mult
				}
			}
			if (i == j) {
				P_pred[i][j] += Q[i]; // Add process noise to diagonal
			}
		}
	}

	// Kalman Gain: K = P_pred * H^T / (H * P_pred * H^T + R)
	float S = R;
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 3; j++) {
			S += H[i] * P_pred[i][j] * H[j];
		}
	}

	float K[3];
	for (int i = 0; i < 3; i++) {
		K[i] = 0.0f;
		for (int j = 0; j < 3; j++) {
			K[i] += P_pred[i][j] * H[j];
		}
		K[i] /= S;
	}

	// Update state: x = x_pred + K * (z - H * x_pred)
	float z_pred = 0.0f;
	for (int i = 0; i < 3; i++) {
		z_pred += H[i] * x_pred[i];
	}

	float y = z_measured - z_pred;

	for (int i = 0; i < 3; i++) {
		kf->x[i] = x_pred[i] + K[i] * y;
	}

	// Update covariance: P = P_pred - K * H * P_pred
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 3; j++) {
			float KH = 0.0f;
			for (int k = 0; k < 3; k++) {
				KH += K[i] * H[k] * P_pred[k][j];
			}
			kf->P[i][j] = P_pred[i][j] - KH;
		}
	}
}



float positionTarget;
float lastPositionTarget;

float speedTarget;
float lastSpeedTarget;

float accelerationTarget;
float accelerationTargetFiltered;

/// Main 10kHz pidSpeed loop



float runPID(volatile PIDController *pid, float currentValue) {
	const float dt = 1.0f / SAMPLE_FREQUENCY; // 0.0001 seconds

	pid->error = currentValue - pid->target;

	// Should this be here? What if the target constantly changes?
	if (fabsf(pid->target - pid->lastTarget) > pid->reset_threshold) {
		pid->prev_error = pid->error;
		pid->lastTarget = pid->target;
	}

	// Integral term with gain applied directly
	pid->integral += pid->i * pid->error * dt;

	// Integral windup protection
	pid->integral = LIMIT(-pid->limit, pid->integral, pid->limit);

	// Derivative with low-pass filter
	pid->derivative = pid->alpha * pid->d * (pid->error - pid->prev_error) / dt + (1.0f - pid->alpha) * pid->derivative;

	// PID output
	pid->output = pid->p * pid->error + pid->integral + pid->derivative;

	// Clamp output
	pid->output = LIMIT(-pid->limit, pid->output, pid->limit);

	// Store error for next iteration
	pid->prev_error = pid->error;

	return pid->output;
}

// Clip PID to 1/8 turn
#define PID_CLIP (TWO_PI / 8.0f * POLE_PAIRS)






/// Timing stuff

unsigned long microsPerReading, microsPrevious, microsUsed;



#define ANGLE_PD_COMP_FACTOR 1.3333333333f



int8_t right;
int8_t backwards;


// -- Constants --
float accelerationTargetAlpha = 0.0004f;         // Filter smoothing factor
float accelerationFeedForwardGain = -80.0f;           // Feedforward gain


MotionCommand debugCMD = {
		.command = COMMAND_QUEUE_LEFT_SIDE,
		.bibiNumber = 0,
		.newPosition = 50,
		.maxSpeed = 10,
		.acceleration = 10,
};

