remidavidkoster/Redako-BibiFirmware/STM32G431/Core/Src/main.cpp
				// Check if the CRC is valid
				if (cmd.crc == CRC_Calculate((uint8_t*)&cmd, sizeof(cmd) - 2)){

					// Get flags from command bits
					uint8_t flags = (cmd.command & 0b11100000) >> 5;

					// Remove flags from command byte
					cmd.command &= 0b11111;

					// Switch byte orders so QLab values make sense
					cmd.bibiNumber = (cmd.bibiNumber << 8) | (cmd.bibiNumber >> 8);
					cmd.newPosition = (cmd.newPosition << 8) | (cmd.newPosition >> 8);

					// Clear CRC for comparison
					cmd.crc = 0;

					// If the new command isn't the same as the last one
					if (memcmp(&lastCmd, &cmd, sizeof(MotionCommand))){

						// Copy it over as new last command
						memcpy(&lastCmd, &cmd, sizeof(MotionCommand));

						// Log command in circular buffer
						logReceivedCommand(&cmd);

						// Pass the message through the sanity check
						if (CMD_SanityCheck(cmd)){

							// If we have to do something
							if (cmd.bibiNumber == BIBI_Number || cmd.bibiNumber == 0 || (cmd.bibiNumber & (1 << (4 + BIBI_Number)))){

								// If we get a queued movement command
								if (cmd.command == COMMAND_QUEUE_LEFT_SIDE || cmd.command == COMMAND_QUEUE_RIGHT_SIDE){

									// Check movementSide
									movementSide = (cmd.command == COMMAND_QUEUE_LEFT_SIDE) ? 1 : -1;

									// Queue movement
									queueMovement((struct MovementStep){cmd.newPosition / 100.0f * movementSide, cmd.maxSpeed / 100.0f, cmd.acceleration / 200.0f}, 0);
								}

								// If we get a queued relative movement command
								else if (cmd.command == COMMAND_RELATIVE_INWARDS || cmd.command == COMMAND_RELATIVE_OUTWARDS){

									// Base direction to move, on current position, and commanded direction (only works once the diabolo is 'in the field' and knows what side he's on)
									movementSide = 0;
									if (diaboloPosition >  0.1f && cmd.command == COMMAND_RELATIVE_INWARDS)  movementSide = 1;
									if (diaboloPosition < -0.1f && cmd.command == COMMAND_RELATIVE_INWARDS)  movementSide = -1;
									if (diaboloPosition >  0.1f && cmd.command == COMMAND_RELATIVE_OUTWARDS) movementSide = -1;
									if (diaboloPosition < -0.1f && cmd.command == COMMAND_RELATIVE_OUTWARDS) movementSide = 1;

									// Queue movement
									queueMovement((struct MovementStep){diaboloPosition + cmd.newPosition / 100.0f * movementSide, cmd.maxSpeed / 100.0f, cmd.acceleration / 200.0f}, 0);
								}

								// If we get a direct queued relative movement command (only works once the diabolo is 'in the field' and knows what side he's on)
								else if (cmd.command == COMMAND_RELATIVE_INWARDS_DIRECT || cmd.command == COMMAND_RELATIVE_OUTWARDS_DIRECT){

									// Base direction to move on current position and commanded direction
									movementSide = 0;
									if (diaboloPosition >  0.1f && cmd.command == COMMAND_RELATIVE_INWARDS_DIRECT)  movementSide = 1;
									if (diaboloPosition < -0.1f && cmd.command == COMMAND_RELATIVE_INWARDS_DIRECT)  movementSide = -1;
									if (diaboloPosition >  0.1f && cmd.command == COMMAND_RELATIVE_OUTWARDS_DIRECT) movementSide = -1;
									if (diaboloPosition < -0.1f && cmd.command == COMMAND_RELATIVE_OUTWARDS_DIRECT) movementSide = 1;

									// Clear movement queue
									queuedMovementCount = 0;
									queuedMovementTail = queuedMovementHead;

									// Queue movement
									startMovement((struct MovementStep){diaboloPosition + cmd.newPosition / 100.0f * movementSide, cmd.maxSpeed / 100.0f, cmd.acceleration / 200.0f});
								}

								// Or overwrite the current movement
								else if (cmd.command == COMMAND_MOVEMENT_LEFT_SIDE || cmd.command == COMMAND_MOVEMENT_RIGHT_SIDE){

									// Check movementSide
									movementSide = (cmd.command == COMMAND_MOVEMENT_LEFT_SIDE) ? 1 : -1;

									// Clear movement queue
									queuedMovementCount = 0;
									queuedMovementTail = queuedMovementHead;

									// Start new movement directly
									startMovement((struct MovementStep){cmd.newPosition / 100.0f * movementSide, cmd.maxSpeed / 100.0f, cmd.acceleration / 200.0f});
								}

								// If we directly want to command the counter weight angle for smoother but less controlled motion
								else if (cmd.command == COMMAND_DIRECT_SET_ANGLE_INWARDS || cmd.command == COMMAND_DIRECT_SET_ANGLE_OUTWARDS){

									// Turn off speed PID
									PID_BibiSpeedWithWeightAngle.on = 0;

									// Base direction to move on current position and commanded direction
									movementSide = 0;
									if (diaboloPosition >  0.1f && cmd.command == COMMAND_DIRECT_SET_ANGLE_INWARDS)  movementSide = 1;
									if (diaboloPosition < -0.1f && cmd.command == COMMAND_DIRECT_SET_ANGLE_INWARDS)  movementSide = -1;
									if (diaboloPosition >  0.1f && cmd.command == COMMAND_DIRECT_SET_ANGLE_OUTWARDS) movementSide = -1;
									if (diaboloPosition < -0.1f && cmd.command == COMMAND_DIRECT_SET_ANGLE_OUTWARDS) movementSide = 1;

									// Clear movement queue
									queuedMovementCount = 0;
									queuedMovementTail = queuedMovementHead;

									// Directly set the weight angle PID target
									PID_WeightAngleWithMotorSpeed.target = cmd.acceleration * movementSide;
								}

								// If we get a shutdown command with the correct safety position value
								else if (cmd.command == COMMAND_SHUTDOWN && cmd.newPosition == COMMAND_SHUTDOWN_SAFETY){

									// If acceleration value is 1, we do a light-less turnoff
									if (cmd.acceleration == 1){
										HAL_GPIO_WritePin(SELF_TURN_ON_GPIO_Port, SELF_TURN_ON_Pin, (GPIO_PinState)0);
									}

									// Turn Bibis off
									SYS_Shutdown();
								}

								// If we have to turn the battery lights off
								else if (cmd.command == COMMAND_LIGHTS_OFF){

									// Simply set brightness to 0. Still feels dangerous not to have an indication they're still on!
									RGB_Brightness = 0;
									RGB_On = 0;
								}
							}
						}
					}
				}
				else {
					// Count mismatches in RAM
					CRC_MismatchCounter++;
				}
			}



			// Calculate and filter acceleration target
			accelerationTarget = (PID_BibiSpeedWithWeightAngle.target - lastSpeedTarget) * SAMPLE_FREQUENCY;
			lastSpeedTarget = PID_BibiSpeedWithWeightAngle.target;

			// Changed this without re-testing. Should be better to apply the feed forward acceleration to the full speed setpoint
			// accelerationTarget = (speedTarget - lastSpeedTarget) * SAMPLE_FREQUENCY;

			// Filter target acceleration (more relevant for remote than for quintic curves
			accelerationTargetFiltered = (1.0f - accelerationTargetAlpha) * accelerationTargetFiltered + accelerationTargetAlpha * accelerationTarget;

			// Add filtered derivative-based feedforward to angle to help drive acceleration
			float angleFeedForward = accelerationFeedForwardGain * accelerationTargetFiltered;

			// Steady state conversion formula didn't seem to help a lot
			// float angleFeedForward = K_ff * computeAngle(accelerationTargetFiltered);



			// Update encoder
			ENC_Update();





